Revit 2027 API
PointCloudOverrideSettings.SetModeOverride Method
 Sets color settings for the given color mode.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetModeOverride(
	PointCloudColorMode mode,
	PointCloudColorSettings colorSettings
)
Public Sub SetModeOverride (
	mode As PointCloudColorMode,
	colorSettings As PointCloudColorSettings
)
public:
void SetModeOverride(
	PointCloudColorMode mode,
	PointCloudColorSettings^ colorSettings
)
member SetModeOverride :
        mode : PointCloudColorMode *
        colorSettings : PointCloudColorSettings -> unit
Parameters
mode PointCloudColorMode
 Color mode for which color settings are set.
colorSettings PointCloudColorSettings
 Color settings to be set for the given color mode.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PointCloudOverrideSettings Class
Autodesk.Revit.DB.PointClouds Namespace